#include <iostream>
#include <iomanip>

using namespace std;
/*******************************
 * 输入m, n=2^m ,有n名选手,共比赛n-1天,要求每个选手都要与其他选手比赛一次,且选手每天都不轮空,设计一个比赛日程表
 * 样例:
 * 输入:2
 * 输出:
 * 1 2 3 4
 * 2 1 4 3
 * 3 4 1 2
 * 4 3 2 1
 *
 * 思路: 从简单的考虑起,例如总的有2个人那么日程表: 1 | 2
 *                                           --+--
 *                                           2 | 1
 *                       总的有4个人那么日程表:
 *                                           1 2 | 3 4
 *                                           2 1 | 4 3
 *                                          -----+-----
 *                                           3 4 | 1 2
 *                                           4 3 | 2 1
 *
 * 每个小方块都是互相对称,大方块由小方块构造而来,因此可以分治。
 *
*******************************/
int main() {
    int n,m;
    cin >> m;
    n = 1 << m;
    int a[100][100];
    int h = 1;
    a[1][1] = 1;
    while (h != n){
        for (int i = 1; i <= h; ++i) {
            for (int j = 1; j <= h; ++j) {
                a[i][j + h] = a[i][j] + h;
                a[i + h][j] = a[i][j + h];
                a[i + h][j + h] = a[i][j];
            }
        }
        h <<= 1;
    }
    for (int k = 1; k <= n; ++k) {
        for (int i = 1; i <= n; ++i) {
            cout << setw(4) << a[k][i];
        }
        cout << endl;
    }
    return 0;
}